-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 14, 2022 at 01:17 PM
-- Server version: 10.4.14-MariaDB
-- PHP Version: 7.4.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fovia`
--

-- --------------------------------------------------------

--
-- Table structure for table `address`
--

CREATE TABLE `address` (
  `id` int(255) NOT NULL,
  `receiver` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `postal_code` varchar(10) COLLATE utf8_persian_ci NOT NULL,
  `cel` varchar(11) COLLATE utf8_persian_ci NOT NULL,
  `phone` text COLLATE utf8_persian_ci NOT NULL,
  `city_id` int(255) NOT NULL DEFAULT 0,
  `address` text COLLATE utf8_persian_ci NOT NULL,
  `user_id` int(255) NOT NULL,
  `delete` int(1) NOT NULL DEFAULT 0 COMMENT '0:ok-1:delete',
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `blogs`
--

CREATE TABLE `blogs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `short_description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `author_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` int(11) NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `visit` int(255) NOT NULL DEFAULT 0,
  `keywords` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `blogs`
--

INSERT INTO `blogs` (`id`, `title`, `short_description`, `text`, `author_name`, `category_id`, `image`, `visit`, `keywords`, `created_at`, `updated_at`) VALUES
(59, 'ما بهترین خدمات مشاوره و خلاقیت را به شما ارائه می دهیم', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\r\n</body>\r\n</html>', 'گروه ستین', 6, 'File/blog/24-10-2020-OVEPHkJXUtiZJSkxOv0lbnNUsQGLlX1w.jpg', 18, 'مقاله , مقاله علمی', '2020-10-24 14:42:03', '2021-07-04 10:39:14'),
(58, 'ما بهترین خدمات مشاوره و خلاقیت را به شما ارائه می دهیم', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\r\n</body>\r\n</html>', 'گروه ستین', 6, 'File/blog/24-10-2020-p6c3g0z2ZB8MizKcH3ASJjJw97sJANSM.jpg', 44, 'مقاله , مقاله علمی', '2020-10-24 14:30:02', '2021-07-12 12:05:12'),
(61, 'ما بهترین خدمات مشاوره و خلاقیت را به شما ارائه می دهیم', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\r\n</body>\r\n</html>', 'گروه ستین', 6, 'File/blog/24-10-2020-p6c3g0z2ZB8MizKcH3ASJjJw97sJANSM.jpg', 39, 'مقاله , مقاله علمی', '2020-10-24 14:30:02', '2021-07-03 11:55:46');

-- --------------------------------------------------------

--
-- Table structure for table `cart`
--

CREATE TABLE `cart` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `number` int(11) NOT NULL,
  `price` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `price_off` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `order_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` int(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`id`, `title`, `type`, `created_at`, `updated_at`) VALUES
(4, 'گرافیک', 1, '2020-07-14 18:04:43', '2020-10-09 06:40:22'),
(6, 'تکنولوژی', 2, '2020-09-27 14:35:15', '2021-06-15 02:35:30'),
(7, 'وب', 1, '2020-09-27 14:35:28', '2020-10-24 14:22:55'),
(8, 'موبایل', 1, '2020-10-06 14:18:29', '2020-10-24 14:22:59'),
(10, 'مهارت فردی', 1, '2020-10-09 06:34:42', '2020-10-24 14:23:31'),
(12, 'کارت ویزیت', 0, '2020-10-09 06:36:12', '2020-10-24 14:21:51'),
(13, 'سخت افزار', 1, '2020-10-09 06:36:22', '2020-10-24 14:23:04'),
(14, 'گرافیک', 2, '2020-10-09 06:36:31', '2020-10-09 06:36:31'),
(15, 'نزدیکترین', 1, '2021-06-15 02:33:03', '2021-06-15 02:33:03');

-- --------------------------------------------------------

--
-- Table structure for table `city`
--

CREATE TABLE `city` (
  `id` int(12) UNSIGNED NOT NULL,
  `province` varchar(255) NOT NULL,
  `name` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `city`
--

INSERT INTO `city` (`id`, `province`, `name`) VALUES
(1, 'آذربايجان شرقي', 'تبريز'),
(2, 'آذربايجان شرقي', 'كندوان'),
(3, 'آذربايجان شرقي', 'بندر شرفخانه'),
(4, 'آذربايجان شرقي', 'مراغه'),
(5, 'آذربايجان شرقي', 'ميانه'),
(6, 'آذربايجان شرقي', 'شبستر'),
(7, 'آذربايجان شرقي', 'مرند'),
(8, 'آذربايجان شرقي', 'جلفا'),
(9, 'آذربايجان شرقي', 'سراب'),
(10, 'آذربايجان شرقي', 'هاديشهر'),
(11, 'آذربايجان شرقي', 'بناب'),
(12, 'آذربايجان شرقي', 'كليبر'),
(13, 'آذربايجان شرقي', 'تسوج'),
(14, 'آذربايجان شرقي', 'اهر'),
(15, 'آذربايجان شرقي', 'هريس'),
(16, 'آذربايجان شرقي', 'عجبشير'),
(17, 'آذربايجان شرقي', 'هشترود'),
(18, 'آذربايجان شرقي', 'ملكان'),
(19, 'آذربايجان شرقي', 'بستان آباد'),
(20, 'آذربايجان شرقي', 'ورزقان'),
(21, 'آذربايجان شرقي', 'اسكو'),
(22, 'آذربايجان شرقي', 'آذر شهر'),
(23, 'آذربايجان شرقي', 'قره آغاج'),
(24, 'آذربايجان شرقي', 'ممقان'),
(25, 'آذربايجان شرقي', 'صوفیان'),
(26, 'آذربايجان شرقي', 'ایلخچی'),
(27, 'آذربايجان شرقي', 'خسروشهر'),
(28, 'آذربايجان شرقي', 'باسمنج'),
(29, 'آذربايجان شرقي', 'سهند'),
(30, 'آذربايجان غربي', 'اروميه'),
(31, 'آذربايجان غربي', 'نقده'),
(32, 'آذربايجان غربي', 'ماكو'),
(33, 'آذربايجان غربي', 'تكاب'),
(34, 'آذربايجان غربي', 'خوي'),
(35, 'آذربايجان غربي', 'مهاباد'),
(36, 'آذربايجان غربي', 'سر دشت'),
(37, 'آذربايجان غربي', 'چالدران'),
(38, 'آذربايجان غربي', 'بوكان'),
(39, 'آذربايجان غربي', 'مياندوآب'),
(40, 'آذربايجان غربي', 'سلماس'),
(41, 'آذربايجان غربي', 'شاهين دژ'),
(42, 'آذربايجان غربي', 'پيرانشهر'),
(43, 'آذربايجان غربي', 'سيه چشمه'),
(44, 'آذربايجان غربي', 'اشنويه'),
(45, 'آذربايجان غربي', 'چایپاره'),
(46, 'آذربايجان غربي', 'پلدشت'),
(47, 'آذربايجان غربي', 'شوط'),
(48, 'اردبيل', 'اردبيل'),
(49, 'اردبيل', 'سرعين'),
(50, 'اردبيل', 'بيله سوار'),
(51, 'اردبيل', 'پارس آباد'),
(52, 'اردبيل', 'خلخال'),
(53, 'اردبيل', 'مشگين شهر'),
(54, 'اردبيل', 'مغان'),
(55, 'اردبيل', 'نمين'),
(56, 'اردبيل', 'نير'),
(57, 'اردبيل', 'كوثر'),
(58, 'اردبيل', 'كيوي'),
(59, 'اردبيل', 'گرمي'),
(60, 'اصفهان', 'اصفهان'),
(61, 'اصفهان', 'فريدن'),
(62, 'اصفهان', 'فريدون شهر'),
(63, 'اصفهان', 'فلاورجان'),
(64, 'اصفهان', 'گلپايگان'),
(65, 'اصفهان', 'دهاقان'),
(66, 'اصفهان', 'نطنز'),
(67, 'اصفهان', 'نايين'),
(68, 'اصفهان', 'تيران'),
(69, 'اصفهان', 'كاشان'),
(70, 'اصفهان', 'فولاد شهر'),
(71, 'اصفهان', 'اردستان'),
(72, 'اصفهان', 'سميرم'),
(73, 'اصفهان', 'درچه'),
(74, 'اصفهان', 'کوهپایه'),
(75, 'اصفهان', 'مباركه'),
(76, 'اصفهان', 'شهرضا'),
(77, 'اصفهان', 'خميني شهر'),
(78, 'اصفهان', 'شاهين شهر'),
(79, 'اصفهان', 'نجف آباد'),
(80, 'اصفهان', 'دولت آباد'),
(81, 'اصفهان', 'زرين شهر'),
(82, 'اصفهان', 'آران و بيدگل'),
(83, 'اصفهان', 'باغ بهادران'),
(84, 'اصفهان', 'خوانسار'),
(85, 'اصفهان', 'مهردشت'),
(86, 'اصفهان', 'علويجه'),
(87, 'اصفهان', 'عسگران'),
(88, 'اصفهان', 'نهضت آباد'),
(89, 'اصفهان', 'حاجي آباد'),
(90, 'اصفهان', 'تودشک'),
(91, 'اصفهان', 'ورزنه'),
(92, 'ايلام', 'ايلام'),
(93, 'ايلام', 'مهران'),
(94, 'ايلام', 'دهلران'),
(95, 'ايلام', 'آبدانان'),
(96, 'ايلام', 'شيروان چرداول'),
(97, 'ايلام', 'دره شهر'),
(98, 'ايلام', 'ايوان'),
(99, 'ايلام', 'سرابله'),
(100, 'بوشهر', 'بوشهر'),
(101, 'بوشهر', 'تنگستان'),
(102, 'بوشهر', 'دشتستان'),
(103, 'بوشهر', 'دير'),
(104, 'بوشهر', 'ديلم'),
(105, 'بوشهر', 'كنگان'),
(106, 'بوشهر', 'گناوه'),
(107, 'بوشهر', 'ريشهر'),
(108, 'بوشهر', 'دشتي'),
(109, 'بوشهر', 'خورموج'),
(110, 'بوشهر', 'اهرم'),
(111, 'بوشهر', 'برازجان'),
(112, 'بوشهر', 'خارك'),
(113, 'بوشهر', 'جم'),
(114, 'بوشهر', 'کاکی'),
(115, 'بوشهر', 'عسلویه'),
(116, 'بوشهر', 'بردخون'),
(117, 'تهران', 'تهران'),
(118, 'تهران', 'ورامين'),
(119, 'تهران', 'فيروزكوه'),
(120, 'تهران', 'ري'),
(121, 'تهران', 'دماوند'),
(122, 'تهران', 'اسلامشهر'),
(123, 'تهران', 'رودهن'),
(124, 'تهران', 'لواسان'),
(125, 'تهران', 'بومهن'),
(126, 'تهران', 'تجريش'),
(127, 'تهران', 'فشم'),
(128, 'تهران', 'كهريزك'),
(129, 'تهران', 'پاكدشت'),
(130, 'تهران', 'چهاردانگه'),
(131, 'تهران', 'شريف آباد'),
(132, 'تهران', 'قرچك'),
(133, 'تهران', 'باقرشهر'),
(134, 'تهران', 'شهريار'),
(135, 'تهران', 'رباط كريم'),
(136, 'تهران', 'قدس'),
(137, 'تهران', 'ملارد'),
(138, 'چهارمحال بختياري', 'شهركرد'),
(139, 'چهارمحال بختياري', 'فارسان'),
(140, 'چهارمحال بختياري', 'بروجن'),
(141, 'چهارمحال بختياري', 'چلگرد'),
(142, 'چهارمحال بختياري', 'اردل'),
(143, 'چهارمحال بختياري', 'لردگان'),
(144, 'چهارمحال بختياري', 'سامان'),
(145, 'خراسان جنوبي', 'قائن'),
(146, 'خراسان جنوبي', 'فردوس'),
(147, 'خراسان جنوبي', 'بيرجند'),
(148, 'خراسان جنوبي', 'نهبندان'),
(149, 'خراسان جنوبي', 'سربيشه'),
(150, 'خراسان جنوبي', 'طبس مسینا'),
(151, 'خراسان جنوبي', 'قهستان'),
(152, 'خراسان جنوبي', 'درمیان'),
(153, 'خراسان رضوي', 'مشهد'),
(154, 'خراسان رضوي', 'نيشابور'),
(155, 'خراسان رضوي', 'سبزوار'),
(156, 'خراسان رضوي', 'كاشمر'),
(157, 'خراسان رضوي', 'گناباد'),
(158, 'خراسان رضوي', 'طبس'),
(159, 'خراسان رضوي', 'تربت حيدريه'),
(160, 'خراسان رضوي', 'خواف'),
(161, 'خراسان رضوي', 'تربت جام'),
(162, 'خراسان رضوي', 'تايباد'),
(163, 'خراسان رضوي', 'قوچان'),
(164, 'خراسان رضوي', 'سرخس'),
(165, 'خراسان رضوي', 'بردسكن'),
(166, 'خراسان رضوي', 'فريمان'),
(167, 'خراسان رضوي', 'چناران'),
(168, 'خراسان رضوي', 'درگز'),
(169, 'خراسان رضوي', 'كلات'),
(170, 'خراسان رضوي', 'طرقبه'),
(171, 'خراسان رضوي', 'سر ولایت'),
(172, 'خراسان شمالي', 'بجنورد'),
(173, 'خراسان شمالي', 'اسفراين'),
(174, 'خراسان شمالي', 'جاجرم'),
(175, 'خراسان شمالي', 'شيروان'),
(176, 'خراسان شمالي', 'آشخانه'),
(177, 'خراسان شمالي', 'گرمه'),
(178, 'خراسان شمالي', 'ساروج'),
(179, 'خوزستان', 'اهواز'),
(180, 'خوزستان', 'ايرانشهر'),
(181, 'خوزستان', 'شوش'),
(182, 'خوزستان', 'آبادان'),
(183, 'خوزستان', 'خرمشهر'),
(184, 'خوزستان', 'مسجد سليمان'),
(185, 'خوزستان', 'ايذه'),
(186, 'خوزستان', 'شوشتر'),
(187, 'خوزستان', 'انديمشك'),
(188, 'خوزستان', 'سوسنگرد'),
(189, 'خوزستان', 'هويزه'),
(190, 'خوزستان', 'دزفول'),
(191, 'خوزستان', 'شادگان'),
(192, 'خوزستان', 'بندر ماهشهر'),
(193, 'خوزستان', 'بندر امام خميني'),
(194, 'خوزستان', 'اميديه'),
(195, 'خوزستان', 'بهبهان'),
(196, 'خوزستان', 'رامهرمز'),
(197, 'خوزستان', 'باغ ملك'),
(198, 'خوزستان', 'هنديجان'),
(199, 'خوزستان', 'لالي'),
(200, 'خوزستان', 'رامشیر'),
(201, 'خوزستان', 'حمیدیه'),
(202, 'خوزستان', 'دغاغله'),
(203, 'خوزستان', 'ملاثانی'),
(204, 'خوزستان', 'شادگان'),
(205, 'خوزستان', 'ویسی'),
(206, 'زنجان', 'زنجان'),
(207, 'زنجان', 'ابهر'),
(208, 'زنجان', 'خدابنده'),
(209, 'زنجان', 'كارم'),
(210, 'زنجان', 'ماهنشان'),
(211, 'زنجان', 'خرمدره'),
(212, 'زنجان', 'ايجرود'),
(213, 'زنجان', 'زرين آباد'),
(214, 'زنجان', 'آب بر'),
(215, 'زنجان', 'قيدار'),
(216, 'سمنان', 'سمنان'),
(217, 'سمنان', 'شاهرود'),
(218, 'سمنان', 'گرمسار'),
(219, 'سمنان', 'ايوانكي'),
(220, 'سمنان', 'دامغان'),
(221, 'سمنان', 'بسطام'),
(222, 'سيستان و بلوچستان', 'زاهدان'),
(223, 'سيستان و بلوچستان', 'چابهار'),
(224, 'سيستان و بلوچستان', 'خاش'),
(225, 'سيستان و بلوچستان', 'سراوان'),
(226, 'سيستان و بلوچستان', 'زابل'),
(227, 'سيستان و بلوچستان', 'سرباز'),
(228, 'سيستان و بلوچستان', 'نيكشهر'),
(229, 'سيستان و بلوچستان', 'ايرانشهر'),
(230, 'سيستان و بلوچستان', 'راسك'),
(231, 'سيستان و بلوچستان', 'ميرجاوه'),
(232, 'فارس', 'شيراز'),
(233, 'فارس', 'اقليد'),
(234, 'فارس', 'داراب'),
(235, 'فارس', 'فسا'),
(236, 'فارس', 'مرودشت'),
(237, 'فارس', 'خرم بيد'),
(238, 'فارس', 'آباده'),
(239, 'فارس', 'كازرون'),
(240, 'فارس', 'ممسني'),
(241, 'فارس', 'سپيدان'),
(242, 'فارس', 'لار'),
(243, 'فارس', 'فيروز آباد'),
(244, 'فارس', 'جهرم'),
(245, 'فارس', 'ني ريز'),
(246, 'فارس', 'استهبان'),
(247, 'فارس', 'لامرد'),
(248, 'فارس', 'مهر'),
(249, 'فارس', 'حاجي آباد'),
(250, 'فارس', 'نورآباد'),
(251, 'فارس', 'اردكان'),
(252, 'فارس', 'صفاشهر'),
(253, 'فارس', 'ارسنجان'),
(254, 'فارس', 'قيروكارزين'),
(255, 'فارس', 'سوريان'),
(256, 'فارس', 'فراشبند'),
(257, 'فارس', 'سروستان'),
(258, 'فارس', 'ارژن'),
(259, 'فارس', 'گويم'),
(260, 'فارس', 'داريون'),
(261, 'فارس', 'زرقان'),
(262, 'فارس', 'خان زنیان'),
(263, 'فارس', 'کوار'),
(264, 'فارس', 'ده بید'),
(265, 'فارس', 'باب انار/خفر'),
(266, 'فارس', 'بوانات'),
(267, 'فارس', 'خرامه'),
(268, 'فارس', 'خنج'),
(269, 'فارس', 'سیاخ دارنگون'),
(270, 'قزوين', 'قزوين'),
(271, 'قزوين', 'تاكستان'),
(272, 'قزوين', 'آبيك'),
(273, 'قزوين', 'بوئين زهرا'),
(274, 'قم', 'قم'),
(275, 'البرز', 'طالقان'),
(276, 'البرز', 'نظرآباد'),
(277, 'البرز', 'اشتهارد'),
(278, 'البرز', 'هشتگرد'),
(279, 'البرز', 'كن'),
(280, 'البرز', 'آسارا'),
(281, 'البرز', 'شهرک گلستان'),
(282, 'البرز', 'اندیشه'),
(283, 'البرز', 'كرج'),
(284, 'البرز', 'نظر آباد'),
(285, 'البرز', 'گوهردشت'),
(286, 'البرز', 'ماهدشت'),
(287, 'البرز', 'مشکین دشت'),
(288, 'كردستان', 'سنندج'),
(289, 'كردستان', 'ديواندره'),
(290, 'كردستان', 'بانه'),
(291, 'كردستان', 'بيجار'),
(292, 'كردستان', 'سقز'),
(293, 'كردستان', 'كامياران'),
(294, 'كردستان', 'قروه'),
(295, 'كردستان', 'مريوان'),
(296, 'كردستان', 'صلوات آباد'),
(297, 'كردستان', 'حسن آباد'),
(298, 'كرمان', 'كرمان'),
(299, 'كرمان', 'راور'),
(300, 'كرمان', 'بابك'),
(301, 'كرمان', 'انار'),
(302, 'كرمان', 'کوهبنان'),
(303, 'كرمان', 'رفسنجان'),
(304, 'كرمان', 'بافت'),
(305, 'كرمان', 'سيرجان'),
(306, 'كرمان', 'كهنوج'),
(307, 'كرمان', 'زرند'),
(308, 'كرمان', 'بم'),
(309, 'كرمان', 'جيرفت'),
(310, 'كرمان', 'بردسير'),
(311, 'كرمانشاه', 'كرمانشاه'),
(312, 'كرمانشاه', 'اسلام آباد غرب'),
(313, 'كرمانشاه', 'سر پل ذهاب'),
(314, 'كرمانشاه', 'كنگاور'),
(315, 'كرمانشاه', 'سنقر'),
(316, 'كرمانشاه', 'قصر شيرين'),
(317, 'كرمانشاه', 'گيلان غرب'),
(318, 'كرمانشاه', 'هرسين'),
(319, 'كرمانشاه', 'صحنه'),
(320, 'كرمانشاه', 'پاوه'),
(321, 'كرمانشاه', 'جوانرود'),
(322, 'كرمانشاه', 'شاهو'),
(323, 'كهكيلويه و بويراحمد', 'ياسوج'),
(324, 'كهكيلويه و بويراحمد', 'گچساران'),
(325, 'كهكيلويه و بويراحمد', 'دنا'),
(326, 'كهكيلويه و بويراحمد', 'دوگنبدان'),
(327, 'كهكيلويه و بويراحمد', 'سي سخت'),
(328, 'كهكيلويه و بويراحمد', 'دهدشت'),
(329, 'كهكيلويه و بويراحمد', 'ليكك'),
(330, 'گلستان', 'گرگان'),
(331, 'گلستان', 'آق قلا'),
(332, 'گلستان', 'گنبد كاووس'),
(333, 'گلستان', 'علي آباد كتول'),
(334, 'گلستان', 'مينو دشت'),
(335, 'گلستان', 'تركمن'),
(336, 'گلستان', 'كردكوي'),
(337, 'گلستان', 'بندر گز'),
(338, 'گلستان', 'كلاله'),
(339, 'گلستان', 'آزاد شهر'),
(340, 'گلستان', 'راميان'),
(341, 'گيلان', 'رشت'),
(342, 'گيلان', 'منجيل'),
(343, 'گيلان', 'لنگرود'),
(344, 'گيلان', 'رود سر'),
(345, 'گيلان', 'تالش'),
(346, 'گيلان', 'آستارا'),
(347, 'گيلان', 'ماسوله'),
(348, 'گيلان', 'آستانه اشرفيه'),
(349, 'گيلان', 'رودبار'),
(350, 'گيلان', 'فومن'),
(351, 'گيلان', 'صومعه سرا'),
(352, 'گيلان', 'بندرانزلي'),
(353, 'گيلان', 'كلاچاي'),
(354, 'گيلان', 'هشتپر'),
(355, 'گيلان', 'رضوان شهر'),
(356, 'گيلان', 'ماسال'),
(357, 'گيلان', 'شفت'),
(358, 'گيلان', 'سياهكل'),
(359, 'گيلان', 'املش'),
(360, 'گيلان', 'لاهیجان'),
(361, 'گيلان', 'خشک بيجار'),
(362, 'گيلان', 'خمام'),
(363, 'گيلان', 'لشت نشا'),
(364, 'گيلان', 'بندر کياشهر'),
(365, 'لرستان', 'خرم آباد'),
(366, 'لرستان', 'ماهشهر'),
(367, 'لرستان', 'دزفول'),
(368, 'لرستان', 'بروجرد'),
(369, 'لرستان', 'دورود'),
(370, 'لرستان', 'اليگودرز'),
(371, 'لرستان', 'ازنا'),
(372, 'لرستان', 'نور آباد'),
(373, 'لرستان', 'كوهدشت'),
(374, 'لرستان', 'الشتر'),
(375, 'لرستان', 'پلدختر'),
(376, 'مازندران', 'ساري'),
(377, 'مازندران', 'آمل'),
(378, 'مازندران', 'بابل'),
(379, 'مازندران', 'بابلسر'),
(380, 'مازندران', 'بهشهر'),
(381, 'مازندران', 'تنكابن'),
(382, 'مازندران', 'جويبار'),
(383, 'مازندران', 'چالوس'),
(384, 'مازندران', 'رامسر'),
(385, 'مازندران', 'سواد كوه'),
(386, 'مازندران', 'قائم شهر'),
(387, 'مازندران', 'نكا'),
(388, 'مازندران', 'نور'),
(389, 'مازندران', 'بلده'),
(390, 'مازندران', 'نوشهر'),
(391, 'مازندران', 'پل سفيد'),
(392, 'مازندران', 'محمود آباد'),
(393, 'مازندران', 'فريدون كنار'),
(394, 'مركزي', 'اراك'),
(395, 'مركزي', 'آشتيان'),
(396, 'مركزي', 'تفرش'),
(397, 'مركزي', 'خمين'),
(398, 'مركزي', 'دليجان'),
(399, 'مركزي', 'ساوه'),
(400, 'مركزي', 'سربند'),
(401, 'مركزي', 'محلات'),
(402, 'مركزي', 'شازند'),
(403, 'هرمزگان', 'بندرعباس'),
(404, 'هرمزگان', 'قشم'),
(405, 'هرمزگان', 'كيش'),
(406, 'هرمزگان', 'بندر لنگه'),
(407, 'هرمزگان', 'بستك'),
(408, 'هرمزگان', 'حاجي آباد'),
(409, 'هرمزگان', 'دهبارز'),
(410, 'هرمزگان', 'انگهران'),
(411, 'هرمزگان', 'ميناب'),
(412, 'هرمزگان', 'ابوموسي'),
(413, 'هرمزگان', 'بندر جاسك'),
(414, 'هرمزگان', 'تنب بزرگ'),
(415, 'هرمزگان', 'بندر خمیر'),
(416, 'هرمزگان', 'پارسیان'),
(417, 'هرمزگان', 'قشم'),
(418, 'همدان', 'همدان'),
(419, 'همدان', 'ملاير'),
(420, 'همدان', 'تويسركان'),
(421, 'همدان', 'نهاوند'),
(422, 'همدان', 'كبودر اهنگ'),
(423, 'همدان', 'رزن'),
(424, 'همدان', 'اسدآباد'),
(425, 'همدان', 'بهار'),
(426, 'يزد', 'يزد'),
(427, 'يزد', 'تفت'),
(428, 'يزد', 'اردكان'),
(429, 'يزد', 'ابركوه'),
(430, 'يزد', 'ميبد'),
(431, 'يزد', 'طبس'),
(432, 'يزد', 'بافق'),
(433, 'يزد', 'مهريز'),
(434, 'يزد', 'اشكذر'),
(435, 'يزد', 'هرات'),
(436, 'يزد', 'خضرآباد'),
(437, 'يزد', 'شاهديه'),
(438, 'يزد', 'حمیدیه شهر'),
(439, 'يزد', 'سید میرزا'),
(440, 'يزد', 'زارچ');

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `fullname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `commentable_id` int(11) NOT NULL,
  `commentable_type` int(11) NOT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `text`, `email`, `fullname`, `image`, `commentable_id`, `commentable_type`, `status`, `created_at`, `updated_at`) VALUES
(32, 'عالی بود', 'y.rouzbehi74@gmail.com', 'روزبهی', 'File/comment/12-07-2021-QDDXQ0BUdUrbCI9WlvVGxdyNb4keVqQI.jpg', 0, 0, 1, '2021-07-12 12:16:20', '2021-07-12 12:16:20'),
(31, 'اسکریپت عالی', 'y.rouzbehi74@gmail.com', 'روزبهی', 'File/comment/12-07-2021-gdhNnLt9rMFSGYudSxiu03sWTrfNA2ch.jpg', 0, 0, 1, '2021-07-12 12:15:58', '2021-07-12 12:15:58');

-- --------------------------------------------------------

--
-- Table structure for table `contacts`
--

CREATE TABLE `contacts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `fullname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `subject` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `counter_title`
--

CREATE TABLE `counter_title` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `number` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `counter_title`
--

INSERT INTO `counter_title` (`id`, `icon`, `title`, `number`, `created_at`, `updated_at`) VALUES
(7, 'fa fa-life-ring', 'پروژه موفق', '18', '2020-10-09 08:29:04', '2020-10-24 14:02:29'),
(5, 'fa fa-user', 'کاربر', '200', '2020-10-06 14:21:24', '2020-10-24 14:03:26'),
(8, 'fa fa-users', 'مشتریان راضی', '1551', '2020-10-24 14:04:18', '2020-10-24 14:04:18'),
(9, 'fa fa-fire', 'درآمد', '151321', '2020-10-24 14:04:49', '2020-10-24 14:07:53');

-- --------------------------------------------------------

--
-- Table structure for table `faq`
--

CREATE TABLE `faq` (
  `id` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `category_id` int(11) NOT NULL,
  `text` text COLLATE utf8_persian_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `faq`
--

INSERT INTO `faq` (`id`, `title`, `category_id`, `text`, `created_at`, `updated_at`) VALUES
(1, 'چگونه می توانم تجارت آنلاین خود را شروع کنم؟', 0, 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.', '2020-10-10 14:16:33', '2020-10-25 06:19:01'),
(3, 'چگونه می توانم تجارت آنلاین خود را شروع کنم؟', 0, 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.', '2020-10-10 14:26:09', '2020-10-25 06:18:20'),
(4, 'چگونه می توانم تجارت آنلاین خود را شروع کنم؟', 0, 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.', '2020-10-25 06:19:26', '2020-10-25 06:19:26'),
(5, 'چگونه می توانم تجارت آنلاین خود را شروع کنم؟', 0, 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.', '2020-10-25 06:19:34', '2020-10-25 06:19:34');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2020_06_08_171110_create_blogs_table', 1),
(5, '2020_06_08_172123_create_comments_table', 1),
(6, '2020_06_08_172746_create_user_comments_table', 1),
(7, '2020_06_08_172847_create_settings_table', 1),
(8, '2020_06_08_173114_create_counter_title_table', 1),
(9, '2020_06_08_173312_create_resumes_table', 1),
(10, '2020_06_08_173738_create_sliders_table', 1),
(11, '2020_06_08_173904_create_services_table', 1),
(12, '2020_06_08_174016_create_contacts_table', 1),
(13, '2020_06_08_174215_create_category_table', 1),
(14, '2020_06_08_174215_create_visitor_table', 1),
(15, '2020_06_08_174248_create_portfolio_table', 1),
(16, '2020_06_08_174718_create_portfolio_skills_table', 1),
(17, '2020_06_08_174822_create_skills_table', 1),
(18, '2020_10_19_163549_create_jobs_table', 2);

-- --------------------------------------------------------

--
-- Table structure for table `order`
--

CREATE TABLE `order` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `date` int(11) NOT NULL,
  `tracking_code` int(11) NOT NULL,
  `shipping_type` int(11) NOT NULL,
  `shipping_cost` varchar(20) COLLATE utf8_persian_ci NOT NULL,
  `shipment_id` int(11) NOT NULL,
  `address_id` int(11) NOT NULL DEFAULT 0,
  `active` int(1) NOT NULL,
  `status` int(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `partner`
--

CREATE TABLE `partner` (
  `id` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `link` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL,
  `image` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `partner`
--

INSERT INTO `partner` (`id`, `title`, `link`, `image`, `created_at`, `updated_at`) VALUES
(2, 'گروه ستین', NULL, 'File/partner/09-10-2020-HPW52sxE0Tpp9UY4lCizvFzlqo41aZ4E.png', '2020-10-09 06:05:20', '2020-10-24 15:43:52'),
(4, 'گروه ستین', NULL, 'File/partner/24-10-2020-7MKocT17GbEOA3xO05vq3n403CTn6yoS.png', '2020-10-24 15:44:32', '2020-10-24 15:44:32'),
(5, 'گروه ستین', NULL, 'File/partner/24-10-2020-5tITl870Yb5n6YIBgFhnwTAPbBHTUqC5.png', '2020-10-24 15:44:44', '2020-10-24 15:44:44'),
(6, 'گروه ستین', NULL, 'File/partner/24-10-2020-d1WHNg2vTyTZgiNuHVGYF1KxUoEcrWQQ.png', '2020-10-24 15:45:06', '2020-10-24 15:45:06'),
(7, 'گروه ستین', NULL, 'File/partner/24-10-2020-YR4pKizmbeHi2FjQfJwQwXQWNTcBUYVU.png', '2020-10-24 15:45:16', '2020-10-24 15:45:16');

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(250) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payment`
--

CREATE TABLE `payment` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `price` varchar(50) COLLATE utf8_persian_ci NOT NULL DEFAULT '0',
  `date` int(11) NOT NULL,
  `status` int(1) NOT NULL,
  `type_payment` int(1) NOT NULL,
  `tracking_code` int(11) NOT NULL,
  `refid` varchar(250) COLLATE utf8_persian_ci NOT NULL,
  `token` varchar(250) COLLATE utf8_persian_ci NOT NULL,
  `price_off` varchar(50) COLLATE utf8_persian_ci NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `portfolio`
--

CREATE TABLE `portfolio` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` int(11) NOT NULL,
  `date` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `customer` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `portfolio`
--

INSERT INTO `portfolio` (`id`, `title`, `text`, `image`, `category_id`, `date`, `customer`, `address`, `created_at`, `updated_at`) VALUES
(1, 'نمونه کار تست', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\r\n</body>\r\n</html>', 'File/portfolio/09-10-2020-hiGnphUvfeOrcvOZWhEH7qt9jZ4wziB8.jpg', 1, '14/06/1398', 'گروه ستین', 'setinco.com', '2020-07-16 12:05:40', '2020-10-23 10:17:40'),
(6, 'قالب‌های متنوع و جذاب', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\r\n</body>\r\n</html>', 'File/portfolio/09-10-2020-Ib8jxyzykr2oNTWhDwRq1qYpB9HXb4Q0.jpg', 2, '14/06/1398', 'گروه ستین', 'setinco.com', '2020-10-06 13:42:54', '2020-10-23 10:17:13'),
(8, 'قالب‌های متنوع و جذاب', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\r\n</body>\r\n</html>', 'File/portfolio/09-10-2020-qfYzXGSIw0nkCZklq9cCkx7drjxUDCVu.jpg', 2, '14/06/1398', 'گروه ستین', 'setinco.com', '2020-10-06 13:45:08', '2020-10-24 13:49:35'),
(10, 'قالب‌های متنوع و جذاب', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\r\n</body>\r\n</html>', 'File/portfolio/09-10-2020-qMdvVetKALzgqEkvXQAN0n7NCWtwGyte.jpg', 3, '14/06/1398', 'گروه ستین', 'https://setinco.com/', '2020-10-09 07:10:14', '2020-10-24 13:41:21');

-- --------------------------------------------------------

--
-- Table structure for table `portfolio_skills`
--

CREATE TABLE `portfolio_skills` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `skills_id` int(11) NOT NULL,
  `portfolio_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `english_title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `image` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `code` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL,
  `price` varchar(20) COLLATE utf8_persian_ci NOT NULL,
  `min_order` int(11) NOT NULL,
  `count` int(11) NOT NULL,
  `discount_percent` int(11) NOT NULL,
  `accounting_code` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL,
  `guarantee` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL,
  `seo` varchar(255) COLLATE utf8_persian_ci DEFAULT NULL,
  `weight` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `length` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `width` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `height` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `type` int(1) NOT NULL,
  `short_description` text COLLATE utf8_persian_ci DEFAULT NULL,
  `description` text COLLATE utf8_persian_ci DEFAULT NULL,
  `delete` int(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`id`, `title`, `english_title`, `image`, `code`, `price`, `min_order`, `count`, `discount_percent`, `accounting_code`, `guarantee`, `seo`, `weight`, `length`, `width`, `height`, `type`, `short_description`, `description`, `delete`, `created_at`, `updated_at`) VALUES
(2, 'لوازم پزشکی', 'Medical products\r\n', 'File/product/14-06-2021-grLjuCFicLAcRh1tjpcaOfqkCQOoXJmY.jpg', '33554545', '1500', 1, 500, 0, '32', 'گارانتی ۱۸ ماهه آونگ', 'dfd', '4', '4', '4', '3', 1, 'dffdasa ddss', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>fdddf</p>\r\n</body>\r\n</html>', 1, '2021-06-14 13:06:20', '2021-06-14 13:28:18'),
(3, 'لوازم پزشکی', 'Medical products\r\n', 'File/product/14-06-2021-ZILYZE3BGfA0rI5h1HSSaIpGWceg7NSh.jpg', '5', '125000', 0, 50, 5, '5', 'گارانتی ۱۸ ماهه کاریان همراه', '55fd  dfdf', '4', '32', '4', '3', 1, 'fdfd', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>fdffddf</p>\r\n</body>\r\n</html>', 1, '2021-06-14 13:07:22', '2021-07-12 06:26:33'),
(4, 'لوازم پزشکی', 'Medical products\r\n', 'File/product/14-06-2021-DFyHHgYdo0WbmLcNYU4xZ96ku7sdcjUy.jpg', '545', '125000', 1, 50, 0, '544', 'گارانتی ۲۴ ماهه یکپارچه (سازگار، حامی(ویستا) و آواژنگ)', '455445', '5', '5', '5', '4', 1, '4454', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>54455445</p>\r\n</body>\r\n</html>', 0, '2021-06-14 13:20:13', '2021-06-14 13:20:13'),
(5, 'لوازم پزشکی', 'Medical products\r\n', 'File/product/12-07-2021-PcQigx4iRi2SV6jfOwSMRk5aqxIkLGnA.jpg', '33443', '1500', 0, 0, 0, NULL, NULL, 'fffd', '4', '4', '4', '4', 1, 'ssssssssssssss', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\nsdddddddddddddddd\r\n</body>\r\n</html>', 0, '2021-07-12 06:44:53', '2021-07-12 06:44:53');

-- --------------------------------------------------------

--
-- Table structure for table `resumes`
--

CREATE TABLE `resumes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `start_date` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `end_date` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` int(11) NOT NULL COMMENT '0:edu-1:jobs',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `services`
--

CREATE TABLE `services` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` int(11) NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `special_service` int(2) NOT NULL DEFAULT 0 COMMENT '0:no-1:activ',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `services`
--

INSERT INTO `services` (`id`, `title`, `text`, `icon`, `category_id`, `image`, `special_service`, `created_at`, `updated_at`) VALUES
(1, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 14, 'File/service/23-10-2020-rGDyzwqGvhE8jKvfXL0ZDBX5rTksbwIo.jpg', 1, '2020-07-14 17:14:39', '2020-10-25 10:11:29'),
(11, 'قالب‌های متنوع و جذاب', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fas fa-chart-bar', 6, 'File/service/04-07-2021-yMCC7O6oPY8wpdC3iCSeirHaJeVs2VSN.jpg', 0, '2020-10-09 08:17:49', '2021-07-04 10:18:38'),
(13, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 6, 'File/service/23-10-2020-bms1N48ckvAAmxQ3peVQBdqvgbuo4DAo.jpg', 0, '2020-10-09 08:20:07', '2021-07-04 10:06:42'),
(14, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 14, 'File/service/23-10-2020-rGDyzwqGvhE8jKvfXL0ZDBX5rTksbwIo.jpg', 1, '2020-07-14 17:14:39', '2020-10-25 10:11:29'),
(15, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 14, 'File/service/23-10-2020-rGDyzwqGvhE8jKvfXL0ZDBX5rTksbwIo.jpg', 1, '2020-07-14 17:14:39', '2020-10-25 10:11:29'),
(16, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fas fa-balance-scale', 6, 'File/service/23-10-2020-bms1N48ckvAAmxQ3peVQBdqvgbuo4DAo.jpg', 0, '2020-10-09 08:20:07', '2021-07-04 10:21:08'),
(17, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 14, 'File/service/23-10-2020-rGDyzwqGvhE8jKvfXL0ZDBX5rTksbwIo.jpg', 1, '2020-07-14 17:14:39', '2020-10-25 10:11:29'),
(19, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 14, 'File/service/23-10-2020-rGDyzwqGvhE8jKvfXL0ZDBX5rTksbwIo.jpg', 1, '2020-07-14 17:14:39', '2020-10-25 10:11:29'),
(21, 'طراحی خلاقانه', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 6, 'File/service/04-07-2021-IoqD2CKMr2U9aj4pSGeldG9hHf4L0YaI.jpg', 0, '2020-10-09 08:19:33', '2021-07-04 10:05:19'),
(22, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 6, 'File/service/23-10-2020-bms1N48ckvAAmxQ3peVQBdqvgbuo4DAo.jpg', 0, '2020-10-09 08:20:07', '2021-07-04 10:06:21'),
(23, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 14, 'File/service/23-10-2020-rGDyzwqGvhE8jKvfXL0ZDBX5rTksbwIo.jpg', 1, '2020-07-14 17:14:39', '2020-10-25 10:11:29'),
(24, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 14, 'File/service/23-10-2020-rGDyzwqGvhE8jKvfXL0ZDBX5rTksbwIo.jpg', 1, '2020-07-14 17:14:39', '2020-10-25 10:11:29'),
(25, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-handshake-o', 14, 'File/service/23-10-2020-bms1N48ckvAAmxQ3peVQBdqvgbuo4DAo.jpg', 0, '2020-10-09 08:20:07', '2020-10-23 09:18:01'),
(26, 'قابلیت های باور نکردنی', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>\r\n</body>\r\n</html>', 'fa fa-cube', 14, 'File/service/23-10-2020-rGDyzwqGvhE8jKvfXL0ZDBX5rTksbwIo.jpg', 1, '2020-07-14 17:14:39', '2020-10-25 10:11:29');

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `value` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `settings`
--

INSERT INTO `settings` (`id`, `name`, `value`, `created_at`, `updated_at`) VALUES
(4, 'titleSite', 'ستین', '2020-07-14 16:22:37', '2022-03-14 07:37:57'),
(5, 'slideTitle', 'محصولات و خلاقیت مارک مد ماست', '2020-07-14 16:22:37', '2020-10-08 13:58:03'),
(6, 'slideDescription', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است', '2020-07-14 16:22:37', '2020-10-08 13:58:03'),
(7, 'skillInfo', 'استودیوی ما فقط در مورد طراحی گرافیک نیست. بیشتر از این است ما خدمات ارتباطی ارائه می دهیم و مسئولیت آن نیز بر عهده ما است', '2020-07-14 16:22:37', '2022-03-14 07:37:57'),
(8, 'serviceInfo', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است', '2020-07-14 16:22:37', '2022-03-14 07:37:57'),
(9, 'portfolioInfo', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است', '2020-07-14 16:22:37', '2020-10-08 16:06:51'),
(10, 'commentInfo', 'برخی از مشتریان عالی و بررسی آنها', '2020-07-14 16:22:37', '2022-03-14 07:37:57'),
(11, 'teamInfo', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است', '2020-07-14 16:22:37', '2022-03-14 07:37:57'),
(12, 'blogInfo', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است', '2020-07-14 16:22:37', '2022-03-14 07:37:57'),
(33, 'favicon', 'File/setting/04-07-2021-qVBlEmquGL1dtWvUix40PZAYfuZM9cB2.png', '2020-10-26 15:59:36', '2021-07-04 10:32:45'),
(14, 'slideImg', 'File/setting/23-10-2020-jdV1gArrT6QrenQqbWEZHxMttnt85Aq6.jpg', '2020-07-14 16:22:37', '2020-10-23 09:29:40'),
(15, 'infoImage', 'File/setting/24-10-2020-v5AL85pqtHjTxobvvWONYcE9GsqIBHR0.jpg', '2020-08-09 15:32:39', '2020-10-24 14:00:30'),
(16, 'facebook', 'https://www.facebook.com/', '2020-08-09 15:32:39', '2020-08-09 15:32:39'),
(17, 'instagram', 'https://www.instagram.com/', '2020-08-09 15:32:39', '2022-03-14 07:37:57'),
(18, 'github', 'https://www.gitlab.com/', '2020-08-09 15:32:39', '2020-08-09 16:23:39'),
(19, 'codepen', 'https://codepen.io/', '2020-08-09 15:32:39', '2020-08-09 15:32:39'),
(20, 'telegram', 'https://codepen.io/', '2020-08-09 15:32:39', '2022-03-14 07:37:57'),
(21, 'twitter', 'https://twitter.com/LOGIN', '2020-09-27 13:58:06', '2020-09-27 14:00:43'),
(22, 'iframe', 'https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3387.544592726579!2d54.35280001449316!3d31.891797535899325!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3fa6198dd5410825%3A0x77cc49919eb1ebca!2zWWF6ZCBQcm92aW5jZSwgWWF6ZCwg2K7bjNin2KjYp9mGINmF2LfZh9ix24zYjCBJcmFu!5e0!3m2!1sen!2s!4v1601183691382!5m2!1sen!2s', '2020-09-27 13:58:06', '2020-09-27 14:00:43'),
(23, 'metatag', NULL, '2020-09-27 13:58:06', '2022-03-14 07:37:57'),
(24, 'keywords', '222', '2020-09-27 13:58:06', '2022-03-14 07:37:57'),
(25, 'infoVideo', 'https://codepen.io/', '2020-09-27 13:58:06', '2020-09-27 14:00:43'),
(66, 'videoImage', 'File/setting/12-07-2021-Sd12v7BNVHo5rQLOy7p2r2pLOObUM6E5.jpg', '2021-07-12 08:57:06', '2021-07-12 08:58:30'),
(27, 'faqImage', 'File/setting/12-07-2021-UpVmj90tTcKwYXzspQ3ar0u9oRNie2yI.jpg', '2020-09-27 13:58:06', '2021-07-12 09:01:17'),
(28, 'contactInfo', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است', '2020-07-14 16:22:37', '2022-03-14 07:37:57'),
(29, 'breadcrumbImage', 'File/setting/04-07-2021-WLOFTFyXST08ulYBovecHGdpNz7dRyh2.jpg', '2020-09-27 13:58:06', '2021-07-04 10:35:10'),
(30, 'aboutInfo', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است', '2020-07-14 16:22:37', '2022-03-14 07:37:57'),
(31, 'footerImage', 'File/setting/21-10-2020-icSmqmbA5g6XRIOzmTtBSOyIdRL0zm69.png', '2020-10-20 15:35:12', '2020-10-21 01:28:58'),
(32, 'skillImage', 'File/setting/12-07-2021-pzWNX2JXA1sLDKgXEnVAlvvFwPrO8lnp.jpg', '2020-10-25 06:12:14', '2021-07-12 08:28:03'),
(34, 'specialservice', '0', '2020-10-28 15:48:50', '2022-03-14 07:37:57'),
(35, 'mobile', '091600000', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(36, 'phone', '03520200', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(37, 'email', 'fovia@gmail.com', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(38, 'address', 'ایران یزد', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(39, 'service', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(40, 'about', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(41, 'product', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(42, 'blog', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(43, 'faq', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(44, 'contact', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(45, 'team', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(46, 'skill', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:58'),
(47, 'comment', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:58'),
(48, 'counter', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:58'),
(49, 'partner', '1', '2021-03-19 05:12:09', '2022-03-14 07:37:58'),
(50, 'view_id', '227769242', '2021-03-19 05:12:09', '2022-03-14 07:37:58'),
(52, 'store_zip_code', '1234567890', '2021-03-19 05:12:09', '2022-03-14 07:37:57'),
(56, 'store_city', '1', '2021-06-15 02:26:28', '2022-03-14 07:37:57'),
(57, 'store_fax', '55554', '2021-06-15 02:26:28', '2022-03-14 07:37:57'),
(58, 'activate_zarrinPal_payment_gateway', '1', '2021-06-15 02:26:28', '2022-03-14 07:37:57'),
(59, 'merchant_zarinpal', 'c3d69a91-a58f-46de-9f1e-2dd32e8ac8e2', '2021-06-15 02:26:28', '2022-03-14 07:37:57'),
(60, 'merchant_idpay', NULL, '2021-06-15 02:26:28', '2022-03-14 07:37:57'),
(61, 'minimum_orde_amount_paid_spot', '2500', '2021-06-15 02:26:28', '2022-03-14 07:37:57'),
(62, 'city_on_site_payment', '[\"3\",\"5\",\"6\"]', '2021-06-15 02:29:34', '2022-03-14 07:37:57'),
(63, 'portfolio', '0', '2021-06-15 02:29:34', '2021-06-15 02:29:34'),
(64, 'idpay_active', '0', '2021-06-15 02:29:34', '2022-03-14 07:37:58'),
(65, 'enable_on_site_payment', '0', '2021-06-15 02:29:34', '2022-03-14 07:37:58'),
(67, 'lat', NULL, '2022-03-14 07:35:21', '2022-03-14 07:37:57'),
(68, 'lng', NULL, '2022-03-14 07:35:21', '2022-03-14 07:37:57');

-- --------------------------------------------------------

--
-- Table structure for table `shipment`
--

CREATE TABLE `shipment` (
  `id` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `english_title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `type_payment` int(1) NOT NULL DEFAULT 0,
  `active` int(1) NOT NULL DEFAULT 0,
  `insurance_rates` int(11) NOT NULL DEFAULT 0,
  `taxation` int(11) NOT NULL DEFAULT 0,
  `fixed_extra_amount` int(11) NOT NULL DEFAULT 0,
  `fixed_extra_percentage` int(11) NOT NULL DEFAULT 0,
  `minimum_order_cost` int(11) NOT NULL DEFAULT 0,
  `surplus_amount` int(11) NOT NULL DEFAULT 0,
  `product_types` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `destination_cities` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `image` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `delete` int(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `shipment_tariff`
--

CREATE TABLE `shipment_tariff` (
  `id` int(11) NOT NULL,
  `shipment_id` int(11) NOT NULL,
  `post_type` int(11) NOT NULL,
  `minimum_weight` int(50) NOT NULL,
  `maximum_weight` int(50) NOT NULL,
  `shipping_cost` int(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `skills`
--

CREATE TABLE `skills` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `percent` int(11) DEFAULT NULL,
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `skills`
--

INSERT INTO `skills` (`id`, `title`, `percent`, `icon`, `description`, `created_at`, `updated_at`) VALUES
(1, 'angular js', 50, 'fab fa-angular', 'با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و ...', '2020-07-14 16:27:41', '2021-07-04 10:45:39'),
(2, 'wordpress', 35, 'fab fa-wordpress', 'با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و ...', '2020-07-14 16:27:52', '2021-07-04 10:46:47'),
(3, 'HTML', 95, 'fab fa-html5', 'با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و ...', '2020-07-14 16:28:00', '2021-07-04 10:47:36'),
(6, 'CSS', 40, 'fa fa-coffee', 'با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و ...', '2020-07-14 16:28:45', '2020-10-25 06:10:28');

-- --------------------------------------------------------

--
-- Table structure for table `sliders`
--

CREATE TABLE `sliders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sliders`
--

INSERT INTO `sliders` (`id`, `title`, `text`, `image`, `created_at`, `updated_at`) VALUES
(1, 'تخصص ما در انتظار شما است', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است', 'File/slider/04-07-2021-IYxAZ5I3eBVP8djcX1ghDr3hdCIqAEqN.jpg', '2020-10-08 11:25:09', '2021-07-04 09:56:42'),
(2, 'تخصص ما در انتظار شما است', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است', 'File/slider/04-07-2021-UW3Hf40t68w1sxris1m3aznKXUWxfnrr.jpg', '2020-10-08 12:14:34', '2021-07-04 09:55:10'),
(4, 'تخصص ما در انتظار شما است', 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است', 'File/slider/04-07-2021-PrxIb81qkSyRJYaAmwithsHuUGbElr5m.jpg', '2021-06-14 11:52:46', '2021-07-04 09:57:35');

-- --------------------------------------------------------

--
-- Table structure for table `social_networks`
--

CREATE TABLE `social_networks` (
  `id` int(11) NOT NULL,
  `title` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `class_font` varchar(50) COLLATE utf8_persian_ci NOT NULL,
  `link` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `team_id` int(255) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `social_networks`
--

INSERT INTO `social_networks` (`id`, `title`, `class_font`, `link`, `team_id`) VALUES
(8, 'اینستاگرام', 'xsaxscsdcdscdscd', 'wwwwww', 35),
(10, 'تلگرام', 'fab fa-telegram', 'telegram.org', 5),
(11, 'واتساپ', 'fab fa-whatsapp', 'https://web.whatsapp.com/', 5),
(12, 'تلگرام', 'fab fa-telegram', 'telegram.org', 7),
(13, 'واتساپ', 'fab fa-whatsapp', 'https://web.whatsapp.com/', 8),
(14, 'تلگرام', 'fab fa-telegram', 'telegram.org', 9),
(15, 'واتساپ', 'fab fa-whatsapp', 'https://web.whatsapp.com/', 9),
(16, 'توئیتر', 'fab fa-twitter', 'https://twitter.com/', 9);

-- --------------------------------------------------------

--
-- Table structure for table `team`
--

CREATE TABLE `team` (
  `id` int(11) NOT NULL,
  `fullname` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `image` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `designation` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `team`
--

INSERT INTO `team` (`id`, `fullname`, `image`, `designation`, `created_at`, `updated_at`) VALUES
(5, 'گروه ستین', 'File/team/09-10-2020-i4JC6a4b1sVcKQHCaVq2qcOITZuZ2vBn.jpg', 'توسعه دهنده', '2020-10-09 04:59:27', '2020-10-24 14:10:38'),
(7, 'گروه ستین', 'File/team/09-10-2020-BIMcOocJJXbph5IbHm5ilAVyyBMkjIwD.jpg', 'توسعه دهنده', '2020-10-09 05:01:02', '2020-10-24 14:12:14'),
(8, 'گروه ستین', 'File/team/09-10-2020-CYxZsc1M169wFTcjhG8NAEJ5u2OXDG3n.jpg', 'توسعه دهنده', '2020-10-09 05:01:59', '2020-10-24 14:12:55'),
(9, 'گروه ستین', 'File/team/09-10-2020-Woi0jhG2MWmYC2wAQAzA2C47PHAvDdTs.jpg', 'مدیر عامل', '2020-10-09 05:02:10', '2020-10-24 14:14:27');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `family` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `birth_date` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `tel` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `national_identity` int(10) NOT NULL DEFAULT 0,
  `resume_file` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(250) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` int(1) NOT NULL DEFAULT 0,
  `username` varchar(250) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `delete` int(1) NOT NULL,
  `type` int(1) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `user_comments`
--

CREATE TABLE `user_comments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `fullname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `user_perm`
--

CREATE TABLE `user_perm` (
  `id` int(255) NOT NULL,
  `user_id` int(255) NOT NULL,
  `perm_route_name` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `visitor`
--

CREATE TABLE `visitor` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ip` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `address`
--
ALTER TABLE `address`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `blogs`
--
ALTER TABLE `blogs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `city`
--
ALTER TABLE `city`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `counter_title`
--
ALTER TABLE `counter_title`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `faq`
--
ALTER TABLE `faq`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order`
--
ALTER TABLE `order`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `partner`
--
ALTER TABLE `partner`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `payment`
--
ALTER TABLE `payment`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `portfolio`
--
ALTER TABLE `portfolio`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `portfolio_skills`
--
ALTER TABLE `portfolio_skills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `resumes`
--
ALTER TABLE `resumes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `shipment`
--
ALTER TABLE `shipment`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `shipment_tariff`
--
ALTER TABLE `shipment_tariff`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `skills`
--
ALTER TABLE `skills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sliders`
--
ALTER TABLE `sliders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `social_networks`
--
ALTER TABLE `social_networks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `team`
--
ALTER TABLE `team`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`),
  ADD UNIQUE KEY `users_username_unique` (`username`);

--
-- Indexes for table `user_comments`
--
ALTER TABLE `user_comments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_perm`
--
ALTER TABLE `user_perm`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `visitor`
--
ALTER TABLE `visitor`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `address`
--
ALTER TABLE `address`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `blogs`
--
ALTER TABLE `blogs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- AUTO_INCREMENT for table `cart`
--
ALTER TABLE `cart`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `category`
--
ALTER TABLE `category`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `city`
--
ALTER TABLE `city`
  MODIFY `id` int(12) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=441;

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `counter_title`
--
ALTER TABLE `counter_title`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `faq`
--
ALTER TABLE `faq`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `order`
--
ALTER TABLE `order`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `partner`
--
ALTER TABLE `partner`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `payment`
--
ALTER TABLE `payment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `portfolio`
--
ALTER TABLE `portfolio`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `portfolio_skills`
--
ALTER TABLE `portfolio_skills`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `product`
--
ALTER TABLE `product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `resumes`
--
ALTER TABLE `resumes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `services`
--
ALTER TABLE `services`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `settings`
--
ALTER TABLE `settings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;

--
-- AUTO_INCREMENT for table `shipment`
--
ALTER TABLE `shipment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `shipment_tariff`
--
ALTER TABLE `shipment_tariff`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `skills`
--
ALTER TABLE `skills`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `sliders`
--
ALTER TABLE `sliders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `social_networks`
--
ALTER TABLE `social_networks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `team`
--
ALTER TABLE `team`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `user_comments`
--
ALTER TABLE `user_comments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `user_perm`
--
ALTER TABLE `user_perm`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- AUTO_INCREMENT for table `visitor`
--
ALTER TABLE `visitor`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
