<?php

namespace App\Http\Controllers;

use Illuminate\Foundation\Auth\Access\AuthorizesRequests;
use Illuminate\Foundation\Bus\DispatchesJobs;
use Illuminate\Foundation\Validation\ValidatesRequests;
use Illuminate\Http\Request;
use Illuminate\Routing\Controller as BaseController;
use Illuminate\Support\Str;
use Yajra\DataTables\DataTables;

class Controller extends BaseController
{
    use AuthorizesRequests, DispatchesJobs, ValidatesRequests;
    public function getAgencylist(Request $request){
        $collection2 = collect([
            [
                "filter"=>"ardabil",
                "province"=> "اردبیل",
                "city"=> "اردبیل ",
                "agency"=> "انفورماتیک گستر کوشای سبلان",
                "phone"=> "04533252490",
                "address"=> "اردبیل،پاساژ صفویه طبقه 2 پلاک 48 شرکت انفورماتیک گسترکوشا سبلان،فروشگاه اکتیو",
                "timeWork"=> "شنبه تا چهارشنبه 10:30 الی 14-بعداز ظهر 17 الی 20:30- پنج شنبه ها 10:30 الی 14"
            ],
            [
                "filter"=>"ardabil",
                "province"=> "اردبیل",
                "city"=> "خلخال",
                "agency"=> "آکسوم موبایل",
                "phone"=> "04532423958",
                "address"=> "خیابان 22 بهمن نبش کوچه علوی ،طبقه همکف،کدپستی:5681834167",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 21"
            ],
            [
                "filter"=>"isfahan",
                "province"=> "اصفهان",
                "city"=> "اصفهان",
                "agency"=> "مرکز خدمات لوتوس",
                "phone"=> "09353113030-03132229114",
                "address"=> "خیابان فردوسی نبش کوچه شهید علیخانی(شماره ۴) ساختمان ۵۰۲،طبقه سوم، واحد ۳۰۱ کد پستی ۸۱۴۴۶۴۸۸۱۵",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 9 الی 13:30-بعد ازظهر 15:30 الی 20"
            ],
            [
                "filter"=>"isfahan",
                "province"=> "اصفهان",
                "city"=> "خمینی شهر  ",
                "agency"=> "گالری موبایل نگین",
                "phone"=> "03133631906",
                "address"=> "خیابان امیر کبیر ، کوچه شماره 150 ، بلوار طالقانی ، پلاک 124 ، طبقه اول ، کد پستی:8417676483",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 13 - 17 الی 23"
            ],
r
            [
                "filter"=>"isfahan",
                "province"=> "اصفهان",
                "city"=> "شاهین شهر ",
                "agency"=> "موبایل پرتقال",
                "phone"=> "03145276656-03145247434",
                "address"=> "بلوار امام خمینی ، پاساژ مریم طبقه همکف ، واحد 39 کد پستی:8314813739",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 13 - 18 الی21"
            ],
            [
                "filter"=>"isfahan",
                "province"=> "اصفهان",
                "city"=> "کاشان",
                "agency"=> "سازگار سیستم",
                "phone"=> "03155577878",
                "address"=> "خیابان زیارتی،روبروی دبیرستان تیزهوشان بهشتی،جنب مخازن پلی اتیلن",
                "timeWork"=> "شنبه تا چهارشنبه 10 الی 14-بعداز ظهر 18 الی 21:30-پنج شنبه ها 10 الی 14"
            ],
            [
                "filter"=>"alborz",
                "province"=> "البرز",
                "city"=> "فردیس",
                "agency"=> "ماد سرویس کرج",
                "phone"=> "02691315315",
                "address"=> " فلکه پنجم بلوار بیات غربی نرسیده به قریشی مجتمع سام طبقه اول واحد 13 کد پستی:317 581 1826",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 13 - 16 الی18"
            ],
            [
                "filter"=>"alborz",
                "province"=> "البرز",
                "city"=> "کرج",
                "agency"=> "گروه phone چی",
                "phone"=> "02632777075-6",
                "address"=> "میدان والفجر ، بلوار سرداران ، رو به روی خیابان میرعماد ، گروه phoneچی",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 14- بعدازظهر 16 ا لی 20-پنج شنبه ها 9 الی 14"
            ],
            [
                "filter"=>"alborz",
                "province"=> "البرز",
                "city"=> "هشتگرد",
                "agency"=> "ماد سرویس هشتگرد",
                "phone"=> "02691315315",
                "address"=> "هشتگرد بلوار مصلی  کوچه طریقی  مجتمع ماهان واحد 1 کد پستی:۳۳۶۱۶۱۸۸۵۱",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 13 - 16 الی18"
            ],
            [
                "filter"=>"ilam",
                "province"=> "ایلام",
                "city"=> "ایلام",
                "agency"=> "موبایل محسن",
                "phone"=> "08433361271",
                "address"=> "ایلام ، میدان 22 بهمن پارکینگ شهرداری ، موبایل محسن",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 9 الی 22-جمعه ها 15 الی 21"
            ],
            [
                "filter"=>"azerbaijan-east",
                "province"=> "آذربایجان شرقی",
                "city"=> "تبریز",
                "agency"=> "خدمات شمشیری",
                "phone"=> "04135555220",
                "address"=> "تبریز، خیابان امام، مابین میدان ساعت و چهارراه منصور، محوطه بین بازار کبود و ابریشم، پلاک 38",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 19"
            ],
            [
                "filter"=>"azerbaijan-east",
                "province"=> "آذربایجان شرقی",
                "city"=> "مراغه",
                "agency"=> "موبایل بتا",
                "phone"=> "04137409004-3",
                "address"=> "کمربنذی شرقی ، حدفاصل 48 متری شهید دهقان و خیابان آزادگان (خلیل اله) کدپستی:5517813374",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 14 - 17 الی22"
            ],
            [
                "filter"=>"azerbaijan-west",
                "province"=> "آذربایجان غربی",
                "city"=> "ارومیه",
                "agency"=> "اروم تکنیک",
                "phone"=> "04432256732",
                "address"=> "خیابان خیام جنوبی،نبش کوچه 17 پلاک 265",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 9 الی 14-بعد ازظهر 16 الی 21"
            ],
            [
                "filter"=>"bushehr",
                "province"=> "بوشهر",
                "city"=> "بوشهر",
                "agency"=> "گروه فنی مهندسی نانو",
                "phone"=> "07733320708-09170828411",
                "address"=> "بوشهر بلوار بهشت صادق روبه روی بانک سپه طبقه همکف کدپستی 7514754154 ",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 13  و 18 الی 21"
            ],
            [
                "filter"=>"tehran",
                "province"=> "تهران",
                "city"=> "اسلامشهر",
                "agency"=> "موبایل فراتل",
                "phone"=> "056378025",
                "address"=> "خ 20 متری امام خمینی پلاک 31",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 14 - 16 الی 21"
            ],
            [
                "filter"=>"tehran",
                "province"=> "تهران",
                "city"=> "پردیس",
                "agency"=> "اورژانس موبایل",
                "phone"=> "076244420",
                "address"=> "فاز دو ، خ مطهری ، بلوار ملاصدرا،پاساژ تجاری میلاد ، طبفه 2 ، واحد 138،کد پستی:1659145119 ",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 13:30 و بعدازظهر 16:00  الی 21:00"
            ],
            [
                "filter"=>"tehran",
                "province"=> "تهران",
                "city"=> "تجریش",
                "agency"=> "موبایل شایلی",
                "phone"=> "02142940",
                "address"=> "تجریش روبه روی بیمارستان شهدا تجریش پاساژ البرز طبقه اول واحد 171 موبایل شایلی",
                "timeWork"=> "شنبه تا پنج شنبه 9 الی 22-جمعه ها 10 الی 14"
            ],
            [
                "filter"=>"tehran",
                "province"=> "تهران",
                "city"=> "دفتر مرکزی خدمات",
                "agency"=> "مدیا پردازش",
                "phone"=> "02142940",
                "address"=> "تهران ، خیابان ایرانشهر ، خیابان کلانتری ، پلاک 45",
                "timeWork"=> "شنبه تا چهارشنبه 8:30 الی 17 - پنج شنبه 8:30 الی 13:00"
            ],
            [
                "filter"=>"tehran",
                "province"=> "تهران",
                "city"=> "رباط کریم",
                "agency"=> "خدمات موبایل شفیعی",
                "phone"=> "56747353_56747335",
                "address"=> "رباط کریم ، گلستان ، سلطان آباد ، خیابان 24 متری شهید چمران ، رو به روی ده متری اول ، پلاک 485  ، طبقه همکف ، کدپستی: 6613813958",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 14 - 16 الی21"
            ],

            [
                "filter"=>"tehran",
                "province"=> "تهران",
                "city"=> "شعبه چارسو",
                "agency"=> "مدیا پردازش",
                "phone"=> "02142940",
                "address"=> "تقاطع بین خ جمهوری و حافظ پاساژ چارسو طبقه منفی 1 واحد a5",
                "timeWork"=> "شنبه تا چهارشنبه 9:00 الی 17 - پنج شنبه 09:00 الی 13:00"
            ],
            [
                "filter"=>"tehran",
                "province"=> "تهران",
                "city"=> "شهریار",
                "agency"=> "موبایل ولیعصر",
                "phone"=> "65267200-09334342000",
                "address"=> "خیابان ولیعصر رو به روی بیمارستان امام سجاد نبش کوچه رباطی پلاک 7 ",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 12:30-بعداز ظهر 16 الی 20-پنج شنبه ها 9 الی 17"
            ],
            [
                "filter"=>"kohgiluyeh-boyer-ahmad",
                "province"=> "چهارمحال و بختیاری",
                "city"=> "بن",
                "agency"=> "موبایل یاس سلیمی",
                "phone"=> "03833724147",
                "address"=> "بلوار صاحب الزمان جنب دفتر اسنار رسمی 15 ، کدپستی:8858134845",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 22"
            ],
            [
                "filter"=>"kohgiluyeh-boyer-ahmad",
                "province"=> "چهارمحال و بختیاری",
                "city"=> "شهرکرد",
                "agency"=> "موبایل هادی",
                "phone"=> "03832263925",
                "address"=> "خیابان 12 محرم،بازار بزرگ میلاد ،فاز دوم طبقه همکف موبایل هادی،خیابان سعدی ، حدفاصل سه راه سینما و چهارراه فصیحی نبش کوچه 54",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 12:30-بعداز ظهر 16 الی 20-پنج شنبه ها 9 الی 14"
            ],
            [
                "filter"=>"khorasan-razavi",
                "province"=> "خراسان رضوی",
                "city"=> "تربت حیدریه",
                "agency"=> "سناتل",
                "phone"=> "05152225210",
                "address"=> "خ فردوسی رو به روی بانک ملت شعبه ، سناتل",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9:30 تا 14:00 و 16 الی 20"
            ],
            [
                "filter"=>"khorasan-razavi",
                "province"=> "خراسان رضوی",
                "city"=> "مشهد",
                "agency"=> "موسسه فراز همراه",
                "phone"=> "8417000",
                "address"=> "خیابن بهشت،مجتمع تجاری هشت بهشت، طبقه اول واحد 106",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 21-پنج شنبه ها 9 الی 14"
            ],
            [
                "filter"=>"khorasan-razavi",
                "province"=> "خراسان رضوی",
                "city"=> "نیشابور",
                "agency"=> "ستاره شهر",
                "phone"=> "0514218028",
                "address"=> "فردوسی شمالی مجتمع تجاری پروانه طبقه همکف پلاک 201",
                "timeWork"=> "شنبه تا پنج شنبه 9 الی 13:30-بعد از ظهر 16:30 الی 21"
            ],
            [
                "filter"=>"khorasan-north",
                "province"=> "خرسان شمالی",
                "city"=> "بجنورد",
                "agency"=> "موبایل خورشید",
                "phone"=> "05832223893",
                "address"=> "میدان شهید،جنب بانک ملت مرکزی طبقه همکف کدپستی:9415898778",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 14 - 17 الی21"
            ],
            [
                "filter"=>"khuzestan",
                "province"=> "خوزستان",
                "city"=> "اهواز ",
                "agency"=> "موبایل پارک",
                "phone"=> "6132223194_6132223150",
                "address"=> "چهارراه نادری ، خیابان سلمان فارسی ، کوچه سراج ، بازار موبایل امیر ، طبقه اول ، کد پستی:6193914837",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 13 - 17 الی 21"
            ],
            [
                "filter"=>"khuzestan",
                "province"=> "خوزستان",
                "city"=> "آبادان ",
                "agency"=> "فروشگاه محمد",
                "phone"=> "09166309095",
                "address"=> "احمد آباد ، خیبان یک ، نبش فرعی هفتم ، فروشگاه محمد",
                "timeWork"=> "شنبه تا جمعه همه روزه  10 الی 14- بعد از ظهر 17 الی 20"
            ],
            [
                "filter"=>"khuzestan",
                "province"=> "خوزستان",
                "city"=> "دزفول",
                "agency"=> "مجتمع خدمات صراف زاده",
                "phone"=> "6142237552",
                "address"=> "بلوار 45 متری مقاومت ، بین مقاومت 11 و 12 پلاک 200",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی18"
            ],
            [
                "filter"=>"zanjan",
                "province"=> "زنجان",
                "city"=> "زنجان",
                "agency"=> "موبایل پدیده نو",
                "phone"=> "02433322180",
                "address"=> "چهارراه سعدی،مجتمع تجاری آریا،طبقه اول،پلاک 35",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 9:30 الی 14-بعد ازظهر 16 الی 21"
            ],
            [
                "filter"=>"semnan",
                "province"=> "سمنان",
                "city"=> "دامغان",
                "agency"=> "میعاد موبایل",
                "phone"=> "0233224097",
                "address"=> "میدان امام جنب مدرسه آقا ، میعاد موبایل",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 21"
            ],
            [
                "filter"=>"semnan",
                "province"=> "سمنان",
                "city"=> "سمنان",
                "agency"=> "گالری موبایلستان",
                "phone"=> "0233444626",
                "address"=> "سمنان ، خیابان یاسر ، گالری موبایلستان",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 12:30-بعداز ظهر 16 الی 20-پنج شنبه ها 9 الی 15"
            ],
            [
                "filter"=>"semnan",
                "province"=> "سمنان",
                "city"=> "شاهرود",
                "agency"=> "میعاد سرویس",
                "phone"=> "0234591048381",
                "address"=> "خ فردوسی ، بین 21 و 23 ، میعاد سرویس",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 22"
            ],
            [
                "filter"=>"sistan-baluchestan",
                "province"=> "سیستان و بلوچستان",
                "city"=> "چابهار",
                "agency"=> "جدگال موبایل",
                "phone"=> "09017250077",
                "address"=> "بلوار امام خمینی جنب بانک ملی مرکزی پاساژ محمدی طبقه اول کد پستی:9973141959",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 21"
            ],
            [
                "filter"=>"sistan-baluchestan",
                "province"=> "سیستان و بلوچستان",
                "city"=> "زاهدان",
                "agency"=> "موبایل عمران",
                "phone"=> "09128995714",
                "address"=> "زاهدان،زاهدان خیابان بهشتی،حد فاصل بهشتی29 و خیابان امام خمینی، طبقه همکف،موبایل عمران",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 21"
            ],

            [
                "filter"=>"fars",
                "province"=> "فارس",
                "city"=> "شیراز",
                "agency"=> "آی زی سرویس",
                "phone"=> "07132223237",
                "address"=> "شیراز ،خیابان زند ، خیابان توحید ، بازار موبایل فارس ، ورودی اول اداری ، ط 4 واحد 403  کد پستی:7137633477",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 14 - 17 الی 21"
            ],
            [
                "filter"=>"qazvin",
                "province"=> "قزوین",
                "city"=> "قزوین",
                "agency"=> "موبایل پردازشگر",
                "phone"=> "028-33363411",
                "address"=> "خیابان خیام شمالی،جنب ساختمان پزشکان رازی،",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 10 الی 13:30 -بعد ازظهر 17 الی 21"
            ],
            [
                "filter"=>"qom",
                "province"=> "قم",
                "city"=> "قم",
                "agency"=> "نگین همراه سرویس",
                "phone"=> "37702000",
                "address"=> "تقاطع عمار یاسر،نبش خیابان طالقانی(اذر)،طبقه بالای انصار",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 8:30 الی 21:30"
            ],
            [
                "filter"=>"kurdistan",
                "province"=> "کردستان",
                "city"=> "سنندج",
                "agency"=> "مرکز خدمات",
                "phone"=> "08733242716",
                "address"=> "سنندج ، خ کشاورز نبش کوچه سوسن ، رو به روی اداره پست پلاک 10 طبقه هکف مرکز خدمات نوکیا و سامسونگ",
                "timeWork"=> "شنبه تا پنج شنبه  همه روزه 9 الی 13- بعداز ظهر 16 الی 20"
            ],
            [
                "filter"=>"golestan",
                "province"=> "گلستان",
                "city"=> "گرگان",
                "agency"=> "موبایل علایی",
                "phone"=> "01732225443",
                "address"=> "خیابان سرخواجه،کوچه 13",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 14:30-بعداز ظهر 17 الی 21-پنج شنبه هاتعطیل"
            ],
            [
                "filter"=>"kerman",
                "province"=> "کرمان",
                "city"=> "کرمان",
                "agency"=> "موبایل میعاد",
                "phone"=> "03432450958",
                "address"=> "خیابان شهید نامجو،بعد از کوچه شماره 5",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 9 الی 13-بعداز ظهر 17 الی 21"
            ],

            [
                "filter"=>"gilan",
                "province"=> "گیلان",
                "city"=> "آستانه اشرفیه ",
                "agency"=> "اورژانس موبایل",
                "phone"=> "76244420",
                "address"=> "فاز دو ، خ مطهری ، بلوار ملاصدرا،پاساژ تجاری میلاد ، طبفه 2 ، واحد 138،کد پستی:1659145119 ",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 21"
            ],
            [
                "filter"=>"gilan",
                "province"=> "گیلان",
                "city"=> "تالش",
                "agency"=> "موبایل پورعینی",
                "phone"=> "1344220302",
                "address"=> "تالش ، خیابان خرمشهر ، ساختمان پورعینی",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 21"
            ],
            [
                "filter"=>"gilan",
                "province"=> "گیلان",
                "city"=> "رشت",
                "agency"=> "جهان ارتباط",
                "phone"=> "01333268100",
                "address"=> "رشت، میدان صیقلان، بلوار احسانبخش، مجتمع توسکا، طبقه 2 واحد 201، شرکت جهان ارتباط",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 9 الی 18"
            ],
            [
                "filter"=>"lorestan",
                "province"=> "لرستان",
                "city"=> " نورآباد",
                "agency"=> "موبایل خسروی",
                "phone"=> "06632734290",
                "address"=> "خیابان امام، سه راه ولیعصر",
                "timeWork"=> "شنبه تا پنج شنبه  همه روزه 9:30 الی 13-بعداز ظهر 17تا 21"
            ],
            [
                "filter"=>"lorestan",
                "province"=> "لرستان",
                "city"=> "بروجرد",
                "agency"=> "موبایل شجاعی",
                "phone"=> "06642601005",
                "address"=> "خیابان حافظ جنوبی ، پلاک 114 ، موبایل شجاعی",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی 22"
            ],
            [
                "filter"=>"mazandaran",
                "province"=> "مازندران",
                "city"=> "امل",
                "agency"=> "خدمات مهرگان",
                "phone"=> "01144151811",
                "address"=> "سبزه میدان،مجتمع اداری میرداماد،طبقه 2،واحد 7",
                "timeWork"=> "شنبه تا چهارشنبه همه روزه 10 الی 14:00-پنج شنبه 10 الی 12:00"
            ],
            [
                "filter"=>"mazandaran",
                "province"=> "مازندران",
                "city"=> "بابلسر",
                "agency"=> "خدمات پارسیان",
                "phone"=> "01135336951-01135255988",
                "address"=> "خ شریفی ، کوچه شهید،شریفی 3 ،،بلوار شهید شریفی ، مجتمع رزقی ، طبقه دوم واحد یک شرقی کدپستی:4741751799",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 12:30-بعداز ظهر 16 الی 20-پنج شنبه ها 9 الی 16"
            ],
            [
                "filter"=>"mazandaran",
                "province"=> "مازندران",
                "city"=> "ساری",
                "agency"=> "ساری تل",
                "phone"=> "01133201111",
                "address"=> "خیابان پانزده خرداد خیابان شهابی خیابان المهدی ",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 13- بعداز ظهرها 16:30الی 20:30- پنج شنبه ها 9 الی 13"
            ],
            [
                "filter"=>"mazandaran",
                "province"=> "مازندران",
                "city"=> "قائم شهر",
                "agency"=> "موبایل دریا",
                "phone"=> "00142204424",
                "address"=> "قائمشهر خیابان بابل تلار 4 ( انتهای کوچه تیر ) موبایل دریا",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه 9 الی 13-بعد ازظهر 16 الی 21"
            ],
            [
                "filter"=>"mazandaran",
                "province"=> "مازندران",
                "city"=> "محمود آباد",
                "agency"=> "نمایندگی بناگر",
                "phone"=> "01144732212",
                "address"=> "مازندران ، محمود آباد،خ آزادی رو به روی بانک ملی پاساژ عباسی، نمایندگر ال جی بناگر ، کدپستی: 4631877978",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی13"
            ],
            [
                "filter"=>"mazandaran",
                "province"=> "مازندران",
                "city"=> "نور",
                "agency"=> "نمایندگی  بناگر",
                "phone"=> "01144552022",
                "address"=> "مازندران ، نور، خیابان مدرس رو به روی هدف 2 ، کدپستی:4641646758 ",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 9 الی13"
            ],
            [
                "filter"=>"markazi",
                "province"=> "مرکزی",
                "city"=> "اراک",
                "agency"=> "موبایل بل",
                "phone"=> "08632240067-08632240068",
                "address"=> "خیابان ملک ، داخل خیابان 17 متری ، شماره  4568 ، موبایل بل، کدپستی :3813834568",
                "timeWork"=> "شنبه تا پنج شنبه همه روزه10:30 الی 13:30-بعداز ظهر 16:30 الی 20:30"
            ],
            [
                "filter"=>"markazi",
                "province"=> "مرکزی",
                "city"=> "ساوه",
                "agency"=> "موبایل حافظ",
                "phone"=> "08642222522",
                "address"=> "میدان شهدا، کوچه امام خمینی 14، خیابان پیاده راه امام خمینی، پاساژ رضا، پلاک 60، طبقه همکف کدپستی:3913934778",
                "timeWork"=> "شنبه تا پنج شنبه ساعت کاری 10 الی 13 - 17 الی21"
            ],
            [
                "filter"=>"hormozgan",
                "province"=> "هرمزگان",
                "city"=> "بندرعباس",
                "agency"=> "موبایل پلاس",
                "phone"=> "07632235189",
                "address"=> "بلوار طالقانی،مجتمع ستاره جنوب، طبقه دوم،پلاک 3،21",
                "timeWork"=> "شنبه تا پنج شنبه 9 الی 13-بعد از ظهر 17 الی 21:30"
            ],
            [
                "filter"=>"hamadan",
                "province"=> "همدان",
                "city"=> "همدان",
                "agency"=> "پاپ موبایل",
                "phone"=> "08132533427",
                "address"=> "خیابان استادان ،نبش 18 متری میلاد ، مارکت موبایل 08138241530",
                "timeWork"=> "شنبه تا پنج شنبه 9:30الی 14-بعداز ظهر 16:30 الی 20-جمعه ها 9:30الی 14"
            ],
            [
                "filter"=>"hamadan",
                "province"=> "همدان",
                "city"=> "همدان",
                "agency"=> "مرکز خدمات داده پردازش نوین",
                "phone"=> "06516633631",
                "address"=> "خیابان بوعلی جنوبی ، روبه روی هتل بوعلی ، کوچه شریف ، پلاک 17 طبقه اول",
                "timeWork"=> "شنبه تا چهارشنبه ساعت کاری 9 الی13:30 - 16:30 الی 19:30-پنج شنبه ها 9 الی 13:30"
            ],
            [
                "filter"=>"yazd",
                "province"=> "یزد",
                "city"=> "یزد",
                "agency"=> "پارس موبایل",
                "phone"=> "03536283234 - 03536242489",
                "address"=> "خیابان کاشانی،جنب مجتمع شهاب ، پارس موبایل کد پستی :8915633447",
                "timeWork"=> "شنبه تا چهارشنبه 9 الی 14- بعد ازظهر 17:30 الی 22"
            ],
            [
                "filter"=>"krmanshah",
                "province"=> "کرمانشاه",
                "city"=> "کرمانشاه",
                "agency"=> "موبایل طاها",
                "phone"=> "08338253387",
                "address"=> "میدان ایثار 200 متر به سمت میدان  امام حسین ع پشت عوارض خودرو شهرداری",
                "timeWork"=> "شنبه تا چهارشنبه 10 الی 17- پنج شنبه ها : 10 الی 14"
            ],
        ]);
        $collection2->toArray();
        if ($request->ajax()) {
            return Datatables::of($collection2)
                ->addIndexColumn()
                ->filter(function ($instance) use ($request) {
                    if (!empty($request->get('nameProvince'))) {
                        $instance->collection = $instance->collection->filter(function ($row) use ($request) {
                            return Str::contains($row['filter'], $request->get('nameProvince')) ? true : false;
                        });
                    }
                })
                ->make(true);
        }
    }
}

