<?php

return [
    'status_installment_order' => [
        'pending' => 'در انتظار پرداخت هزینه استعلام',
        'awaiting_validation' => 'در انتظار اعتبار سنجی',
        'approved_validation' => 'تایید اعتبار سنجی',
        'reject_validation' => 'رد اعتبار سنجی',
        'awaiting_document' => 'در انتظار آپلود مدارک',
        'approved_document' => 'تایید مدارک',
        'reject_document' => 'رد مدارک',
        'awaiting_credit' => 'در انتظار تخصیص اعتبار',
        'complete' => 'صدور اعتبار',
    ],
    'report_status_installment_order' => [
        '0' => 'در انتظار بررسی',
        '1' => 'تایید شده و قابل دریافت',
        '3' => 'تایید اولیه انجام شده',
        '11' => 'پرداخت شده',
        '17' => 'در انتظار تایید ثانویه شخص',
        '18' => 'تایید ثانویه انجام شده و در انتظار پاسخ سرویس',
        '13' => 'گزارش آماده دریافت',
        '4' => 'گزارش دیده شد',
        '5' => 'گزارش منقضی شده است',
    ]
];
