<?php

return array(

    'updateSuccess' => 'بروزرسانی موفق',
    'updateAlert' => 'اگر کد های سورس را شخصی سازی نموده اید، از انجام بروزرسانی بپرهیزید و یا قبل از بروزرسانی بکاپ بگیرید!',
    'updateBackupNotice' => 'قبل از بروزرسانی از دیتابیس بکاپ تهیه نمایید.',
    'yesUpdateIt' => 'بله، بروزرسانی کن!',
    'fileDeleted' => 'فایل با موفقیت حذف گردید.',
    'add_to_cart_success' => 'به سبد خرید شما افزوده شد.',
    'product_not_enough' => 'تعداد کالای انتخابی، بیش از سقف مجاز است.',
    'price_not_found' => 'کالای مورد نظر یافت نشد.',
    'add_favorite' => 'محصول مورد نظر به لیست علاقمندی ها اضافه شد.',
    'remove_favorite' => 'محصول مورد نطر از لیست علاقمندی ها حذف شد.',
    'remove_to_cart_success' => 'از سبد خرید شما حذف گردید.',
);
